tap "candid82/brew"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/formula-analytics"
tap "homebrew/services"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"
tap "tomanthony/brews"
tap "yqrashawn/goku"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Cross-platform make
brew "cmake"
# Go dependency management tool
brew "dep"
# Command-line tool for the fn project
brew "fn"
# GitHub command-line tool
brew "gh"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Helm Charts as Code tool
brew "helmsman"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Build tool for Clojure
brew "leiningen"
# Oracle Cloud Infrastructure CLI
brew "oci-cli"
# Simplistic interactive filtering tool
brew "peco"
# Object-relational database system
brew "postgresql", restart_service: true
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Rust toolchain installer
brew "rustup-init"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Process YAML documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
brew "tomanthony/brews/itermocil"
# karabiner configurator
brew "yqrashawn/goku/goku"
cask "android-platform-tools"
cask "bitwarden"
cask "docker"
cask "duplicati"
cask "firefox"
cask "font-fira-code"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite-no-mail"
cask "hammerspoon"
cask "iterm2"
cask "itsycal"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keybase"
cask "kitty"
cask "lunar"
cask "menumeters"
cask "osxfuse"
cask "postman"
cask "rectangle"
cask "slack"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"
