tap "candid82/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/formula-analytics"
tap "homebrew/services"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"
tap "tomanthony/brews"
tap "yqrashawn/goku"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Cross-platform make
brew "cmake"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simplistic interactive filtering tool
brew "peco"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Internet file retriever
brew "wget"
# Process YAML documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
brew "tomanthony/brews/itermocil"
# karabiner configurator
brew "yqrashawn/goku/goku"
# Android SDK component
cask "android-platform-tools"
# Data backup and storage service
cask "backblaze"
# Web browser focusing on privacy
cask "brave-browser"
# Web browser
cask "firefox"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Keyboard customizer
cask "karabiner-elements"
# End-to-end encryption software
cask "keybase"
# Adaptive brightness for external displays
cask "lunar"
# Set of CPU, memory, disk, and network monitoring tools
cask "menumeters"
# Collaboration platform for API development
cask "postman"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
